Revit 2027 API
PerformanceAdviser.GetPerformanceAdviser Method
 Returns the only instance of PerformanceAdviser in the Application.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static PerformanceAdviser GetPerformanceAdviser()
Public Shared Function GetPerformanceAdviser As PerformanceAdviser
public:
static PerformanceAdviser^ GetPerformanceAdviser()
static member GetPerformanceAdviser : unit -> PerformanceAdviser
Return Value
PerformanceAdviser
 The only instance of PerformanceAdviser in the Application.
See Also
Reference
PerformanceAdviser Class
Autodesk.Revit.DB Namespace